; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-38)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
(at ball35 room5)
(at ball36 room5)
(at ball37 room5)
(at ball38 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
(at ball35 room5)
(at ball36 room5)
(at ball37 room5)
(at ball38 room5)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 31 of 38
2. (pick ball14 roomb left)
   deleted: (at ball14 roomb) (free left)
   added: (carry ball14 left)
   goals met: 31 of 38
3. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 31 of 38
4. (drop ball14 room3 left)
   deleted: (carry ball14 left)
   added: (at ball14 room3) (free left)
   goals met: 32 of 38
5. (pick ball24 room3 left)
   deleted: (at ball24 room3) (free left)
   added: (carry ball24 left)
   goals met: 32 of 38
6. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 32 of 38
7. (drop ball24 room4 left)
   deleted: (carry ball24 left)
   added: (at ball24 room4) (free left)
   goals met: 33 of 38
8. (pick ball30 room4 left)
   deleted: (at ball30 room4) (free left)
   added: (carry ball30 left)
   goals met: 33 of 38
9. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 33 of 38
10. (drop ball30 room5 left)
   deleted: (carry ball30 left)
   added: (at ball30 room5) (free left)
   goals met: 34 of 38
11. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 34 of 38
12. (pick ball13 roomb left)
   deleted: (at ball13 roomb) (free left)
   added: (carry ball13 left)
   goals met: 34 of 38
13. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 34 of 38
14. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 35 of 38
15. (pick ball23 room3 left)
   deleted: (at ball23 room3) (free left)
   added: (carry ball23 left)
   goals met: 35 of 38
16. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 35 of 38
17. (drop ball23 room4 left)
   deleted: (carry ball23 left)
   added: (at ball23 room4) (free left)
   goals met: 36 of 38
18. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 36 of 38
19. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 36 of 38
20. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 36 of 38
21. (drop ball12 room3 left)
   deleted: (carry ball12 left)
   added: (at ball12 room3) (free left)
   goals met: 37 of 38
22. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 37 of 38
23. (pick ball11 roomb left)
   deleted: (at ball11 roomb) (free left)
   added: (carry ball11 left)
   goals met: 37 of 38
24. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 37 of 38
25. (drop ball11 room3 left)
   deleted: (carry ball11 left)
   added: (at ball11 room3) (free left)
   goals met: 38 of 38
